---
kind: type
id: T:Autodesk.Revit.DB.Visual.Hardwood
source: html/8863f7b6-bf52-9b0b-430d-1c11f3871fed.htm
---
# Autodesk.Revit.DB.Visual.Hardwood

A static class that provides access to the property names that appear in the Hardwood visual asset schema.

## Syntax (C#)
```csharp
public static class Hardwood
```